In [1]:
name = ['Saif', 'Abhinav', 'Sahil', 'Rakesh', 'Ishita', 'Akash']
city = ['Ludhiana', 'Jammu', 'Chandigarh', 'Jammu', 'Dehradun', 'Ludhiana']
gender = ['M', 'M', 'M', 'M', 'F', 'M']

In [2]:
stu_dict = { 
'Name' : name,
'City' : city ,
'Gender' : gender
}

In [3]:
import pandas as pd

In [4]:
data = pd.DataFrame(stu_dict)

In [5]:
data

      Name        City Gender
0     Saif    Ludhiana      M
1  Abhinav       Jammu      M
2    Sahil  Chandigarh      M
3   Rakesh       Jammu      M
4   Ishita    Dehradun      F
5    Akash    Ludhiana      M

In [6]:
data.head()

      Name        City Gender
0     Saif    Ludhiana      M
1  Abhinav       Jammu      M
2    Sahil  Chandigarh      M
3   Rakesh       Jammu      M
4   Ishita    Dehradun      F

In [7]:
data.head(2)

      Name      City Gender
0     Saif  Ludhiana      M
1  Abhinav     Jammu      M

In [8]:
data.tail()

      Name        City Gender
1  Abhinav       Jammu      M
2    Sahil  Chandigarh      M
3   Rakesh       Jammu      M
4   Ishita    Dehradun      F
5    Akash    Ludhiana      M

In [9]:
data.tail(2)

     Name      City Gender
4  Ishita  Dehradun      F
5   Akash  Ludhiana      M

In [10]:
data['Name']

0       Saif
1    Abhinav
2      Sahil
3     Rakesh
4     Ishita
5      Akash
Name: Name, dtype: object

In [11]:
data[['Name', 'City']]

      Name        City
0     Saif    Ludhiana
1  Abhinav       Jammu
2    Sahil  Chandigarh
3   Rakesh       Jammu
4   Ishita    Dehradun
5    Akash    Ludhiana

In [12]:
data['Name'][data['City'] == 'Jammu']

1    Abhinav
3     Rakesh
Name: Name, dtype: object